[
  [ "Modifiable Examples",
    "Want to learn how programs work by breaking them and figuring out how to fix them again? These are relatively simple pieces of code meant to illustrate particular ideas of Computer Science. (COMING SOON)",
    [
    ]
  ],
  [ "Online Programming Environments",
    "Want to create your own project but not sure how to start? These sites let you code and see your program run without a lot of setup. Many also have documentation to explain how things work.",
    [
        [
            "Khan Academy's Processing Environment",
            "This is a good library for graphics and animations, and your code runs automatically as you write it, so you can see how it works.",
            "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/",
            "Beginner Intermediate",
            "JavaScript",
            "Gaming Animation Graphics"
        ],
        [
            "Minecraft Redstone and Command Blocks",
            "If you have a Minecraft account, try programming command blocks and making redstone circuits to automate elements in your world.",
            "http://minecraft.gamepedia.com/Redstone_circuit",
            "Beginner Intermediate Advanced",
            "Any",
            "Gaming"
        ],
        [
            "Scratch",
            "Scratch is a drag-and-drop programming language developed at MIT to teach computer science.",
            "https://scratch.mit.edu/projects/editor/",
            "Beginner Intermediate",
            "Scratch",
            "Animations Gaming"
        ],
        [
            "App Inventor",
            "App Inventor uses a Scratch-like language, but for mobile app development. If you have an Android phone, you can set it up to automatically run your app as you write it.",
            "http://ai2.appinventor.mit.edu/",
            "Beginner Intermediate",
            "Scratch",
            "Mobile"
        ],
        [
            "JS Fiddle",
            "This site makes it easy to test out your web development, with separate areas to write your HTML, CSS, and JavaScript.",
            "https://jsfiddle.net/",
            "Intermediate Advanced",
            "HTML CSS JavaScript",
            "WebDev"
        ]
    ]
  ],
  [ "Tutorials",
    "Want to learn a specific library, idea, or language and then run with your own ideas? These explain how to write a full basic program, setting you up to make your own changes on top of it. (COMING SOON)",
    [
    ]
  ],
  [
    "Exercises/Games",
    "Want concrete goals and immediate feedback on whether you succeeded? Try these.",
    [
      [
        "Code.org",
        "The Hour of Code activities involve a lot of short exercises for beginners. There are also a number of videos and ideas on more advanced topics.",
        "https://code.org/learn",
        "Beginner Intermediate",
        "Scratch Blockly JavaScript",
        "Drawing Animation Basics"
      ],
      [
        "Code Combat",
        "In this game, you program your characters and items to compete against the computer or against other players.",
        "https://codecombat.com/",
        "Intermediate Advanced",
        "JavaScript Python Java",
        "Gaming"
      ],
      [
        "Khan Academy",
        "The Computer Science track includes a combination of short exercises, short videos, and open-ended projects.",
        "https://www.khanacademy.org/computing/computer-programming",
        "Beginner Intermediate Advanced",
        "JavaScript HTML CSS SQL",
        "Drawing Animation WebDev Gaming Physics Basics"
      ],
      [
        "Ruby Warrior",
        "In this game, you program a character to complete levels of a turn-based dungeon crawl game.",
        "https://www.bloc.io/ruby-warrior#/",
        "Intermediate",
        "Ruby",
        "Gaming"
      ],
      [
        "Rosalind",
        "These bioinformatics problems can be done in any programming language.",
        "http://rosalind.info/problems/tree-view/",
        "Intermediate Advanced",
        "Any",
        "Biology"
      ],
      [
        "Untrusted",
        "In this game, you can edit only specific areas of code in order to get your character through mazes.",
        "https://alexnisnevich.github.io/untrusted/",
        "Intermediate",
        "JavaScript",
        "Gaming"
      ],
      [
        "Project Euler",
        "These challenging math problems require the speed and memory of a computer to solve. Many require you to use optimized numerical computation techniques.",
        "https://projecteuler.net/",
        "Intermediate Advanced",
        "Any",
        "Math Algorithms"
      ],
      [ 
        "Codecademy",
        "These courses take you through the basics of a specific programming language or library.",
        "https://www.codecademy.com/", 
        "Beginner Intermediate",
        "HTML CSS JavaScript PHP Python Ruby Java SQL",
        "WebDev Basics"
      ],
      [
        "USA Computing Olympiad",
        "Try the online training exercises used for programming competition participants.",
        "http://www.usaco.org/",
        "Intermediate Advanced",
        "C++ Java Python Pascal C",
        "Algorithms"
      ],
      [
        "Hacker Rank",
        "This site has a wide variety of problems with auto-graders in many programming languages.",
        "https://www.hackerrank.com",
        "Beginner Intermediate Advanced",
        "Any SQL C++ Java Python Ruby",
        "Basic Algorithms Math AI RegEx"
      ],
      [
        "Regex Crossword",
        "These puzzles will help you learn about regular expressions, one way that computers can recognize text.",
        "https://regexcrossword.com/",
        "Beginner Intermediate",
        "Any",
        "RegEx"
      ],
      [
        "Lightbot",
        "In this game, you program a robot to hop around through a maze.",
        "https://lightbot.com/",
        "Beginner",
        "Custom",
        "Basics"
      ],
      [
        "Learn You a Node",
        "This program takes you through a series of exercises covering the basics of the Node webserver.",
        "https://github.com/workshopper/learnyounode",
        "Advanced",
        "JavaScript",
        "WebDev"
      ]
    ]
  ],
  [
    "Online Courses",
    "Would you like video lectures and problem sets? Some of these courses also have automatic graders so that you can tell if your code worked.",
    [
      [
        "Harvard's CS50",
        "Harvard's intro computer science course, released as a MOOC.",
        "https://www.edx.org/course/introduction-computer-science-harvardx-cs50x#!",
        "Beginner Intermediate",
        "Scratch C PHP JavaScript SQL CSS HTML",
        "Biology Crytography Finance Forensics Gaming Basics"
      ],
      [
        "UC Berkeley's Beauty and Joy of Computing",
        "Cal's intro computer science course, released as a MOOC.",
        "https://www.edx.org/course/beauty-joy-computing-cs-principles-part-uc-berkeleyx-bjc-12x",
        "Beginner Intermediate",
        "Snap",
        "Basics Algorithms"
      ],
      [
        "MIT's Intro to Computer Science and Programming Using Python",
        "MIT's intro computer science course, released as a MOOC.",
        "https://www.edx.org/course/introduction-computer-science-mitx-6-00-1x-8",
        "Beginner Intermediate",
        "Python",
        "Basics Algorithms"
      ],
      [
        "Stanford's Computer Science Courses",
        "Stanford has made many of its classes available online, mostly through Coursera.",
        "http://online.stanford.edu/courses/topic/4",
        "Intermediate Advanced",
        "Any",
        "Basics Algorithms Math MachineLearning"
      ],
      [
        "Edx Computer Science Courses",
        "Beyond the Edx classes above, there are a number of computer science courses on a variety of topics on the Edx platform.",
        "https://www.edx.org/course/subject/computer-science",
        "Beginnger Intermediate Advanced",
        "Any Python Java",
        "Basics Algorithms WebDev Math MachineLearning Statistics"
      ],
      [
        "Coursera Computer Science Courses",
        "Coursera has a variety of classes that explain how to apply computer science to various topics.",
        "https://www.coursera.org/courses?languages=en&query=computer+science",
        "Advanced",
        "Any Python",
        "Math Statistics Neuroscience Finance Graphics Robotics"
      ],
      [
        "Udacity",
        "Udacity's Computer Science courses focus on mobile development and machine learning.",
        "https://www.udacity.com/courses/all",
        "Advanced",
        "Any Java JavaScript",
        "Mobile MachineLearning Statistics"
      ]
    ]
  ],
  [
    "Online Coursework",
    "Want to work through a regular college class? These don't always have the video lectures, but they do have all of the readings and homework assignments that you would do as a student at that institution.",
    [
        [
            "Harvey Mudd's CS5",
            "Harvey Mudd was a pioneer in computer science education, one of the first institutions to update their curriculum. This is now one of the most popular courses at the school.",
            "https://www.cs.hmc.edu/twiki/bin/view/CS5",
            "Beginner Intermediate",
            "Python",
            "Basics Algorithms Biology Cryptography Circuits Math"
        ],
        [
            "MIT's Computer Science Classes",
            "In addition to the classes released as MOOCs, MIT has publically released archives of many other courses.",
            "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/",
            "Beginner Intermediate Advanced",
            "Python Java C++ Matlab Any",
            "Basics Algorithms Cryptography Math Biology Physics Robotics Circuits"
        ]
    ]
  ]
]
